In [9]:
import pandas as pd

In [10]:
data=pd.read_csv('./Dataset/train.csv')
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [11]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 889 entries, 0 to 888
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  889 non-null    int64
 1   Survived     889 non-null    int64
 2   Pclass       889 non-null    int64
 3   Name         889 non-null    object
 4   Sex          889 non-null    object
 5   Age          889 non-null    float64
 6   SibSp        889 non-null    int64
 7   Parch        889 non-null    int64
 8   Ticket       889 non-null    object
 9   Fare         889 non-null    float64
 10  Cabin        202 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.5+ KB

**Encoding of categorical variables**

In [12]:
from sklearn.preprocessing import LabelEncoder
encoder=LabelEncoder()

In [13]:
data['Sex']=encoder.fit_transform(data['Sex'])
data['Embarked']=encoder.fit_transform(data['Embarked'])

In [14]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,NaN,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,C85,0
2,3,1,3,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,7.9250,NaN,2
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,113803,53.1000,C123,2
4,5,0,3,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,NaN,2

**Check for null values**

Clearbly,Cabin feature have more than 75% as null values and needed to be dropped.

In [15]:
data.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
dtype: int64

**Dropping of irrelevant features**

In [16]:
data=data.drop(['Cabin','PassengerId','Name','Ticket'],axis=1)
data.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0         0       3    1  22.0      1      0   7.2500         2
1         1       1    0  38.0      1      0  71.2833         0
2         1       3    0  26.0      0      0   7.9250         2
3         1       1    0  35.0      1      0  53.1000         2
4         0       3    1  35.0      0      0   8.0500         2

**Function definition that calculates model accuracy score and confusion matrix**

In [17]:
def metrics_model(a,b):
    #Calculates the accuracy and confusion matrix
    from sklearn.model_selection import train_test_split
    from sklearn import svm
    clf=svm.SVC(gamma=0.01,C=100)
    from sklearn.metrics import accuracy_score,confusion_matrix
    x_train,x_test,y_train,y_test=train_test_split(a,b,test_size=0.3,random_state=0)
    clf.fit(x_train,y_train)
    y_pred=clf.predict(x_test)
    s=accuracy_score(y_test,y_pred,normalize=True)
    c=confusion_matrix(y_test,y_pred)
    return s,c

**Define dependent and independent variables for various model**

In [18]:
y=data.iloc[:,1:2]
y.head()

   Pclass
0       3
1       1
2       3
3       1
4       3

In [19]:
x=data.drop(["Pclass"],axis=1)
x.head()

   Survived  Sex   Age  SibSp  Parch     Fare  Embarked
0         0    1  22.0      1      0   7.2500         2
1         1    0  38.0      1      0  71.2833         0
2         1    0  26.0      0      0   7.9250         2
3         1    0  35.0      1      0  53.1000         2
4         0    1  35.0      0      0   8.0500         2

In [20]:
y1=data.iloc[:,2:3]
y1.head()

   Sex
0    1
1    0
2    0
3    0
4    1

In [21]:
x1=data.drop(["Sex"],axis=1)
x1.head()

   Survived  Pclass   Age  SibSp  Parch     Fare  Embarked
0         0       3  22.0      1      0   7.2500         2
1         1       1  38.0      1      0  71.2833         0
2         1       3  26.0      0      0   7.9250         2
3         1       1  35.0      1      0  53.1000         2
4         0       3  35.0      0      0   8.0500         2

In [22]:
y2=data.iloc[:,4:5]
y2.head()

   SibSp
0      1
1      1
2      0
3      1
4      0

In [23]:
x2=data.drop(["SibSp"],axis=1)
x2.head()

   Survived  Pclass  Sex   Age  Parch     Fare  Embarked
0         0       3    1  22.0      0   7.2500         2
1         1       1    0  38.0      0  71.2833         0
2         1       3    0  26.0      0   7.9250         2
3         1       1    0  35.0      0  53.1000         2
4         0       3    1  35.0      0   8.0500         2

In [24]:
y3=data.iloc[:,5:6]
y3.head()

   Parch
0      0
1      0
2      0
3      0
4      0

In [25]:
x3=data.drop(["Parch"],axis=1)
x3.head()

   Survived  Pclass  Sex   Age  SibSp     Fare  Embarked
0         0       3    1  22.0      1   7.2500         2
1         1       1    0  38.0      1  71.2833         0
2         1       3    0  26.0      0   7.9250         2
3         1       1    0  35.0      1  53.1000         2
4         0       3    1  35.0      0   8.0500         2

In [26]:
y4=data.iloc[:,7:]
y4.head()

   Embarked
0         2
1         0
2         2
3         2
4         2

In [27]:
x4=data.iloc[:,0:7]
x4.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare
0         0       3    1  22.0      1      0   7.2500
1         1       1    0  38.0      1      0  71.2833
2         1       3    0  26.0      0      0   7.9250
3         1       1    0  35.0      1      0  53.1000
4         0       3    1  35.0      0      0   8.0500

**Model 1 (Pclass vs all)**

In [28]:
score1,matrix1=metrics_model(x,y)
print("The accuracy score is:",score1)
print("The counfusion matrix is:")
print(matrix1)

The accuracy score is: 0.9026217228464419
The counfusion matrix is:
[[ 64   4   2]
 [  4  36   9]
 [  1   6 141]]

C:\Users\Komal\anaconda3\lib\site-packages\sklearn\utils\validation.py:760: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

**Conclusion**

Out of **total 267** records only **241 are successfully classified**, giving a model **accuracy** of **90%**.

**Model 2 (Sex vs all)**

In [29]:
score2,matrix2=metrics_model(x1,y1)
print("The accuracy score is:",score2)
print("The counfusion matrix is:")
print(matrix2)

The accuracy score is: 0.7265917602996255
The counfusion matrix is:
[[ 66  32]
 [ 41 128]]

C:\Users\Komal\anaconda3\lib\site-packages\sklearn\utils\validation.py:760: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

**Conclusion**

Out of **total 267** records only **194 are successfully classified**, giving a model **accuracy** of **73%**.

**Model 3 (SibSp vs all)**

In [30]:
score3,matrix3=metrics_model(x2,y2)
print("The accuracy score is:",score3)
print("The counfusion matrix is:")
print(matrix3)

The accuracy score is: 0.7490636704119851
The counfusion matrix is:
[[150  24   7   0   1   0   0]
 [ 21  39   5   0   0   0   0]
 [  4   1   3   0   0   0   0]
 [  0   2   1   3   1   0   0]
 [  0   0   0   0   2   0   0]
 [  0   0   0   0   0   1   0]
 [  0   0   0   0   0   0   2]]

C:\Users\Komal\anaconda3\lib\site-packages\sklearn\utils\validation.py:760: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

**Conclusion**

Out of **total 267** records only **200 are successfully classified**, giving a model **accuracy** of **75%**.

**Model 4 (Parch vs all)**

In [31]:
score4,matrix4=metrics_model(x3,y3)
print("The accuracy score is:",score4)
print("The counfusion matrix is:")
print(matrix4)

The accuracy score is: 0.797752808988764
The counfusion matrix is:
[[187   6   5   0   0   0]
 [ 21  15   3   0   0   1]
 [ 10   6  11   0   0   0]
 [  0   0   1   0   0   0]
 [  1   0   0   0   0   0]
 [  0   0   0   0   0   0]]

C:\Users\Komal\anaconda3\lib\site-packages\sklearn\utils\validation.py:760: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

**Conclusion**

Out of **total 267** records only **213 are successfully classified**, giving a model **accuracy** of **80%**.

**Model 5 (Embarked vs all)**

In [32]:
score5,matrix5=metrics_model(x4,y4)
print("The accuracy score is:",score5)
print("The counfusion matrix is:")
print(matrix5)

The accuracy score is: 0.7677902621722846
The counfusion matrix is:
[[ 23   2  24]
 [  0   8  14]
 [ 18   4 174]]

C:\Users\Komal\anaconda3\lib\site-packages\sklearn\utils\validation.py:760: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

**Conclusion**

Out of **total 267** records only **205 are successfully classified**, giving a model **accuracy** of **76%**.